Repository: Adirow/flmhaiti_fall25team
Catalog: lib/l10n/arb/app_*.arb
Languages: fr

# appName
source: Dental EMR
fr: EMR Dentaire

# loginTitle
source: House of David
fr: Maison de David

# loginTagline
source: Developed by CMU Heinz College Capstone Team
fr: Développé par l'équipe Capstone du CMU Heinz College

# emailRequiredError
source: Please enter email
fr: Veuillez saisir votre e-mail

# emailInvalidError
source: Please enter valid email
fr: Veuillez saisir un e-mail valide

# passwordLabel
source: Password
fr: Mot de passe

# passwordRequiredError
source: Please enter password
fr: Veuillez saisir votre mot de passe

# passwordLengthError
source: Password must be at least 6 characters
fr: Le mot de passe doit contenir au moins 6 caractères

source: Sign In
fr: Se connecter

source: Forgot Password?
fr: Mot de passe oublié ?

# signUpPrompt
source: Don't have an account?
fr: Vous n'avez pas de compte ?

source: Sign Up
fr: Inscrivez-vous

# dashboardTitle
source: Dashboard
fr: Tableau de bord

# dashboardWelcome
source: House of David - Welcome Back!
fr: Maison de David - Bon retour !

# dashboardSubheading
source: Developed by CMU Heinz College Capstone Team
fr: Développé par l'équipe Capstone du CMU Heinz College

# patientsCardSubtitle
source: Manage patient records
fr: Gérer les dossiers patients

# appointmentsCardTitle
source: Appointments
fr: Rendez-vous

# appointmentsCardSubtitle
source: Schedule & manage
fr: Planifier et gérer

# encountersCardTitle
source: Encounters
fr: Consultations

# encountersCardSubtitle
source: Clinical exams
fr: Examens cliniques

# formsCardTitle
source: Form Templates
fr: Modèles de formulaires

# formsCardSubtitle
source: Manage questionnaires
fr: Gérer les questionnaires

# reportsCardTitle
source: Reports (In progress)
fr: Rapports (En cours)

# reportsCardSubtitle
source: Analytics & insights
fr: Analyses et informations

source: Recent Activity
fr: Activité récente

source: Today's Appointments
fr: Rendez-vous du jour

source: Pending Reviews
fr: Revues en attente

source: New Patients This Week
fr: Nouveaux patients cette semaine

# languageSelectorLabel
source: Language
fr: Langue

# languageEnglish
source: English
fr: Anglais

# languageFrench
source: French
fr: Français

# languageHaitianCreole
source: Haitian Creole
fr: Créole haïtien

# genderMale
source: Male
fr: Homme

# genderFemale
source: Female
fr: Femme

# genderOther
source: Other
fr: Autre

# patientsAddTitle
source: Add New Patient
fr: Ajouter un nouveau patient

# patientsNameLabel
source: Full Name
fr: Nom complet

# patientsNameRequired
source: Please enter name
fr: Veuillez saisir le nom

# patientsGenderLabel
source: Gender
fr: Genre

# patientsGenderRequired
source: Please select gender
fr: Veuillez sélectionner le genre

# patientsDobLabel
source: Date of Birth
fr: Date de naissance

# patientsDobPlaceholder
source: Select date
fr: Sélectionner une date

# patientsDobSelectPlaceholder
source: Select Date of Birth
fr: Sélectionnez la date de naissance

# patientsPhoneLabel
source: Phone Number
fr: Numéro de téléphone

# patientsPhoneRequired
source: Please enter phone
fr: Veuillez saisir le téléphone

# patientsAddressLabel
source: Address
fr: Adresse

# patientsAddressRequired
source: Please enter address
fr: Veuillez saisir l'adresse

# patientsBloodPressureLabel
source: Blood Pressure
fr: Pression artérielle

# patientsBloodPressureHint
source: e.g., 120/80
fr: ex. 120/80

# patientsBloodPressureOptionalLabel
source: Blood Pressure (optional)
fr: Pression artérielle (optionnel)

# patientsSaveButton
source: Save Patient
fr: Enregistrer le patient

# commonRequiredFieldsError
source: Please fill all required fields
fr: Veuillez remplir tous les champs requis

# commonUserNotAuthenticated
source: User not authenticated
fr: Utilisateur non authentifié

# patientsAddSuccess
source: Patient added successfully
fr: Patient ajouté avec succès

# patientsAddError
source: Failed to add patient
fr: Échec de l'ajout du patient

# patientsDuplicateNameTitle
source: Duplicate Name Found
fr: Nom en double trouvé

# patientsDuplicateNameMessage
source: The name "{name}" is already used by {count} patient(s). Continue saving?
fr: Le nom "{name}" est déjà utilisé par {count} patient(s). Continuer l'enregistrement ?

# patientsDuplicateExisting
source: Existing patients:
fr: Patients existants :

# commonCancel
source: Cancel
fr: Annuler

# patientsDuplicateContinueButton
source: Yes, Save Anyway
fr: Oui, enregistrer quand même

# patientsDetailTitle
source: Patient Details
fr: Détails du patient

# patientsIdLabel
source: Patient ID
fr: ID patient

# patientsAgeLabel
source: Age
fr: Âge

# patientsAgeYearsSuffix
source: years
fr: ans

# patientsBornLabel
source: Born
fr: Né(e) :

# patientsQuickActions
source: Quick Actions
fr: Actions rapides

# patientsMedicalHistoryAction
source: Medical History
fr: Historique médical

# patientsNewEncounterAction
source: New Encounter
fr: Nouvelle consultation

# patientsAppointmentsAction
source: Appointments
fr: Rendez-vous

# patientsReportsAction
source: Reports
fr: Rapports

# patientsRecentEncounters
source: Recent Encounters
fr: Consultations récentes

# patientsEncounterTypeRoutineCheckup
source: Routine Checkup
fr: Contrôle de routine

# patientsEncounterTypeDentalCleaning
source: Dental Cleaning
fr: Nettoyage dentaire

# patientsEncounterTypeToothExtraction
source: Tooth Extraction
fr: Extraction dentaire

# patientsNewButtonLabel
source: New Patient
fr: Nouveau patient

# patientsSearchHint
source: Search patients...
fr: Rechercher des patients...

# patientsLoadErrorTitle
source: Failed to load patients
fr: Échec du chargement des patients

# commonRetry
source: Retry
fr: Réessayer

# patientsEmptyTitle
source: No patients found
fr: Aucun patient trouvé

# patientsEmptySubtitle
source: Add your first patient to get started
fr: Ajoutez votre premier patient pour commencer

# patientsSearchNoResultsTitle
source: No patients match your search
fr: Aucun patient ne correspond à votre recherche

# patientsSearchNoResultsSubtitle
source: Try adjusting your search terms
fr: Essayez d'ajuster vos termes de recherche

# patientsEditingTitle
source: Editing Patient
fr: Modification du patient

# patientsSaveChangesButton
source: Save Changes
fr: Enregistrer les modifications

# patientsUpdateSuccess
source: Patient updated successfully
fr: Patient mis à jour avec succès

# patientsUpdateError
source: Failed to update patient
fr: Échec de la mise à jour du patient

# patientsDeleteTitle
source: Delete Patient
fr: Supprimer le patient

# patientsDeleteConfirmationMessage
source: Are you sure you want to delete {name}? This action cannot be undone.
fr: Voulez-vous vraiment supprimer {name} ? Cette action est irréversible.

# commonDelete
source: Delete
fr: Supprimer

# patientsDeleteSuccess
source: Patient deleted successfully
fr: Patient supprimé avec succès

# patientsDeleteError
source: Failed to delete patient
fr: Échec de la suppression du patient

# questionnairesLoadErrorTitle
source: Failed to load questionnaires
fr: Échec du chargement des questionnaires

# questionnairesStartCardTitle
source: Start New Questionnaire
fr: Commencer un nouveau questionnaire

# questionnairesNoTemplates
source: No questionnaire templates available
fr: Aucun modèle de questionnaire disponible

# questionnairesSelectDepartment
source: Select Department
fr: Sélectionner un département

# questionnairesNoTemplatesForDepartment
source: No templates available for {department}
fr: Aucun modèle disponible pour {department}

# questionnairesSelectTemplate
source: Select Questionnaire
fr: Sélectionner un questionnaire

# questionnairesStartButton
source: Start Questionnaire
fr: Démarrer le questionnaire

# questionnairesPreviousTitle
source: Previous Questionnaires
fr: Questionnaires précédents

# questionnairesNoHistory
source: No previous questionnaires
fr: Aucun questionnaire précédent

# questionnairesStartError
source: Failed to start questionnaire: {error}
fr: Échec du démarrage du questionnaire : {error}

# questionnaireSavingLabel
source: Saving...
fr: Enregistrement...

# questionnaireStatusSubmitted
source: SUBMITTED
fr: SOUMIS

# questionnaireStatusDraft
source: DRAFT
fr: BROUILLON

# questionnaireAutoSaveFailed
source: Auto-save failed: {error}
fr: Échec de l'enregistrement automatique : {error}

# questionnaireSubmitSuccess
source: Questionnaire submitted successfully!
fr: Questionnaire soumis avec succès !

# questionnaireSubmitError
source: Failed to submit questionnaire: {error}
fr: Échec de la soumission du questionnaire : {error}

# questionnaireLoadErrorTitle
source: Failed to load questionnaire
fr: Échec du chargement du questionnaire

# questionnaireEmptyTitle
source: No questions found
fr: Aucune question trouvée

# questionnaireEmptySubtitle
source: This questionnaire appears to be empty
fr: Ce questionnaire semble vide

# questionnaireSubmitButton
source: Submit Questionnaire
fr: Soumettre le questionnaire

# questionnaireSubmittedReadOnlyMessage
source: This questionnaire has been submitted and is now read-only.
fr: Ce questionnaire a été soumis et est désormais en lecture seule.

# questionnaireSelectDate
source: Select date...
fr: Sélectionner une date...

# questionnaireTextHint
source: Enter your answer...
fr: Entrez votre réponse...

# questionnaireNumberHint
source: Enter a number...
fr: Entrez un nombre...

# questionnaireChoiceHint
source: Select an option...
fr: Sélectionnez une option...

# questionnaireBooleanYes
source: Yes
fr: Oui

# encountersTitle
source: Encounters
fr: Consultations

# encountersCreateNew
source: New Encounter
fr: Nouvelle consultation

# encountersContinue
source: Continue
fr: Continuer

# encountersStatusInProgress
source: In Progress
fr: En cours

# encountersStatusCompleted
source: Completed
fr: Terminée

# encountersStatusDraft
source: Draft
fr: Brouillon

# encountersLastUpdated
source: Last updated {time}
fr: Dernière mise à jour {time}

# encountersNoEncounters
source: No encounters yet
fr: Aucune consultation pour le moment

# encountersNoEncountersSubtitle
source: Start by creating a new encounter
fr: Commencez en créant une nouvelle consultation

# encountersLoadError
source: Failed to load encounters
fr: Échec du chargement des consultations

# encountersStartError
source: Failed to start encounter: {error}
fr: Échec du démarrage de la consultation : {error}

# encountersDeleteConfirm
source: Delete encounter?
fr: Supprimer la consultation ?

# encountersDeleteMessage
source: Are you sure you want to delete this encounter?
fr: Voulez-vous vraiment supprimer cette consultation ?

# encountersDeleteSuccess
source: Encounter deleted
fr: Consultation supprimée

# encountersDeleteError
source: Failed to delete encounter
fr: Échec de la suppression de la consultation

# encountersToolsTitle
source: Encounter Tools
fr: Outils cliniques

# encountersToolVitals
source: Vitals
fr: Signes vitaux

# encountersToolMedications
source: Medications
fr: Médicaments

# encountersToolProcedures
source: Procedures
fr: Procédures

# encountersSave
source: Save
fr: Enregistrer

# encountersSubmit
source: Submit
fr: Soumettre

# encountersCancel
source: Cancel
fr: Annuler

# formsTitle
source: Form Templates
fr: Modèles de formulaires

# formsCreateNew
source: Create Template
fr: Créer un modèle

# formsEdit
source: Edit
fr: Modifier

# formsDelete
source: Delete
fr: Supprimer

# formsDuplicate
source: Duplicate
fr: Dupliquer

# formsPublish
source: Publish
fr: Publier

# formsUnpublish
source: Unpublish
fr: Retirer

# formsActiveBadge
source: Active
fr: Actif

# formsDraftBadge
source: Draft
fr: Brouillon

# formsNoTemplates
source: No form templates
fr: Aucun modèle de formulaire

# formsNoTemplatesSubtitle
source: Create your first template to get started
fr: Créez votre premier modèle pour commencer

# formsSearchHint
source: Search templates...
fr: Rechercher des modèles...

# formsLastUpdated
source: Last updated {time}
fr: Dernière mise à jour {time}

# formsLoadError
source: Failed to load templates
fr: Échec du chargement des modèles

# formsCreateSuccess
source: Template created successfully
fr: Modèle créé avec succès

# formsCreateError
source: Failed to create template
fr: Échec de la création du modèle

# formsUpdateSuccess
source: Template updated successfully
fr: Modèle mis à jour avec succès

# formsUpdateError
source: Failed to update template
fr: Échec de la mise à jour du modèle

# formsDeleteConfirm
source: Delete template?
fr: Supprimer le modèle ?

# formsDeleteMessage
source: Are you sure you want to delete this template?
fr: Voulez-vous vraiment supprimer ce modèle ?

# formsDeleteSuccess
source: Template deleted
fr: Modèle supprimé

# formsDeleteError
source: Failed to delete template
fr: Échec de la suppression du modèle

# encountersLoadingTitle
source: Loading...
fr: Chargement...

# encountersEditTitle
source: Edit Encounter
fr: Modifier la consultation

# encountersNewTitle
source: New Encounter
fr: Nouvelle consultation

# encountersInitErrorTitle
source: Failed to initialize encounter
fr: Échec de l'initialisation de la consultation

# encountersInitError
source: Failed to initialize encounter: {error}
fr: Échec de l'initialisation de la consultation : {error}

# encountersInfoSectionTitle
source: Encounter Information
fr: Informations sur la consultation

# encountersExamTypeLabel
source: Exam Type
fr: Type d'examen

# encountersChiefComplaintLabel
source: Chief Complaint
fr: Motif principal

# encountersChiefComplaintHint
source: Main reason for visit
fr: Raison principale de la visite

# encountersChiefComplaintRequired
source: Please enter chief complaint
fr: Veuillez saisir le motif principal

# encountersNotesLabel
source: Clinical Notes
fr: Notes cliniques

# encountersNotesHint
source: Additional observations and notes
fr: Observations et notes supplémentaires

# encountersSavedSuccess
source: Encounter saved successfully
fr: Consultation enregistrée avec succès

# encountersErrorMissingPatient
source: Patient information is missing. Please select a patient first.
fr: Informations patient manquantes. Veuillez d'abord sélectionner un patient.

# encountersErrorNotLoggedIn
source: Please log in to create an encounter.
fr: Veuillez vous connecter pour créer une consultation.

# encountersErrorMissingClinic
source: Clinic information is missing. Please contact support.
fr: Informations sur la clinique manquantes. Veuillez contacter le support.

# encountersErrorDatabase
source: Database error. Please check your connection and try again.
fr: Erreur de base de données. Vérifiez votre connexion et réessayez.

# encountersErrorSave
source: Failed to save encounter: {error}
fr: Échec de l'enregistrement de la consultation : {error}

# encountersCloseTool
source: Close Tool
fr: Fermer l'outil

# encountersNoTools
source: No tools available
fr: Aucun outil disponible

# encountersNoToolsSubtitle
source: Tools will appear here when configured for this department
fr: Les outils apparaîtront ici lorsqu'ils seront configurés pour ce service

# encountersToolLoadError
source: Failed to load tool: {toolId}
fr: Échec du chargement de l'outil : {toolId}

# encountersDepartmentsLoading
source: Loading departments...
fr: Chargement des services...

# encountersDepartmentsLoadError
source: Failed to load departments
fr: Échec du chargement des services

# encountersDepartmentsEmpty
source: No departments available
fr: Aucun service disponible

# encountersDepartmentLabel
source: Department
fr: Service

# formsStatusLabel
source: Status
fr: Statut

# formsStatusAll
source: All
fr: Tous

# formsStatusActive
source: Active
fr: Actifs

# formsStatusArchived
source: Archived
fr: Archivés

# formsNoTemplatesFound
source: No templates found
fr: Aucun modèle trouvé

# formsNoTemplatesSearch
source: No templates match your search
fr: Aucun modèle ne correspond à votre recherche

# formsNoTemplatesSearchSubtitle
source: Try adjusting your search terms
fr: Essayez d'ajuster vos termes de recherche

# formsDuplicateSuccess
source: Template "{name}" duplicated successfully
fr: Modèle « {name} » dupliqué avec succès

# formsDuplicateError
source: Failed to duplicate template: {error}
fr: Échec de la duplication du modèle : {error}

# formsArchiveConfirmTitle
source: Archive Template
fr: Archiver le modèle

# formsArchiveConfirmMessage
source: Are you sure you want to archive "{name}"? It will no longer be available for new forms.
fr: Voulez-vous vraiment archiver « {name} » ? Il ne sera plus disponible pour de nouveaux formulaires.

# formsArchiveAction
source: Archive
fr: Archiver

# formsArchiveSuccess
source: Template "{name}" archived
fr: Modèle « {name} » archivé

# formsArchiveError
source: Failed to archive template: {error}
fr: Échec de l'archivage du modèle : {error}

# formsDetailsArchivedBadge
source: ARCHIVED
fr: ARCHIVÉ

# formsNoDescription
source: No description
fr: Aucune description

# formsPopupEdit
source: Edit
fr: Modifier

# formsPopupDuplicate
source: Duplicate
fr: Dupliquer

# formsPopupArchive
source: Archive
fr: Archiver

# formsSectionsAddTooltip
source: Add Section
fr: Ajouter une section

# formsSectionsEmptyTitle
source: No sections yet
fr: Aucune section pour le moment

# formsSectionsEmptySubtitle
source: Add a section to get started
fr: Ajoutez une section pour commencer

# formsQuestionsPlaceholder
source: Select a section to edit questions
fr: Sélectionnez une section pour modifier les questions

# formsPreviewModeNotice
source: Preview mode â€“ inputs are disabled
fr: Mode aperçu – les champs sont désactivés

# formsSectionRename
source: Rename
fr: Renommer

# formsSectionDelete
source: Delete
fr: Supprimer

# formsSectionDeleteTitle
source: Delete Section
fr: Supprimer la section

# formsSectionDeleteMessage
source: Are you sure you want to delete "{name}"? This will also delete all questions in this section.
fr: Voulez-vous vraiment supprimer « {name} » ? Cela supprimera aussi toutes les questions de cette section.

# formsUnsavedBadge
source: UNSAVED
fr: NON ENREGISTRÉ

# formsTemplateInfoTitle
source: Template Information
fr: Informations sur le modèle

# formsTemplateNameLabel
source: Template Name
fr: Nom du modèle

# formsTemplateNameRequired
source: Please enter a template name
fr: Veuillez saisir un nom de modèle

# formsTemplateNameHint
source: Enter template name
fr: Saisissez le nom du modèle

# formsTemplateDescriptionHint
source: Enter template description
fr: Entrez la description du modèle

# formsSaveSuccess
source: Template saved successfully
fr: Modèle enregistré avec succès

# formsSaveError
source: Failed to save template: {error}
fr: Échec de l'enregistrement du modèle : {error}

# formsDiscardChangesTitle
source: Unsaved Changes
fr: Modifications non enregistrées

# formsDiscardChangesMessage
source: You have unsaved changes. Do you want to discard them?
fr: Vous avez des modifications non enregistrées. Voulez-vous les abandonner ?

# formsDiscardButton
source: Discard
fr: Abandonner

# formsTabTemplate
source: Template
fr: Modèle

# formsTabPreview
source: Preview
fr: Aperçu
